In [332]:
import pandas as pd
from sklearn.datasets import fetch_california_housing
df = fetch_california_housing(as_frame=True).frame
df.sample()
list(df.columns)
pd.options.display.max_columns = 500
#df.info()
#df.describe()
#df['HouseAge'].mean()
#df.HouseAge.std()
#df.HouseAge.median()
#df.HouseAge.mode()
# df.HouseAge.count()
# df.HouseAge.sum()

In [333]:
import matplotlib.pyplot as plt
# df.HouseAge.plot.bar(figsize=(12,8))
# plt.title('House Age')
# plt.show()

# df.plot(figsize=(12,8))
# plt.tight_layout()

In [334]:
import yfinance as yf

# stock_df = yf.download('AAPL')
# stock_df.plot()

df = pd.DataFrame({
    'name':['Mike','Alice','Bob'],
    'age':[21,22,25],
    'job': ['CTO', 'CTO', 'CTO']
})

df = df.set_index('name')
#df.loc['Alice','age']
#df.iloc[1,0]
#df.at['Alice','age']
df.loc['John'] = [90, 'CTO']
df.loc['Alice'] = [75, 'CTO']
#df.iloc[0:4 , 1]
df.age = df.age // 2
df = df.reset_index()
df

    name  age  job
0   Mike   10  CTO
1  Alice   37  CTO
2    Bob   12  CTO
3   John   45  CTO

In [335]:
import random as r

def myfunction():
    i=r.randint(3, 99)
    if i % 3 == 0:
        return i ** 2
    print('ERROR')
#myfunction()

def myfunction2(x):
    if x.endswith('r'):
        return 'Without Job :D'
    else:
        return "You're fired!"
#df.job.apply(myfunction2)
#df.age.apply(lambda x: x**2)
#df.age.apply(lambda x: r.randint(3,99))
df['summary'] = df.apply(lambda x: f'Age: {x['age']}, Job: {x['job']}', axis=1)

In [336]:
#df = df.drop(['job', 'summary'], axis=1)
df.at['Alice' , 'age'] = float('nan')
#df.info()

#df.dropna()
df.fillna(df.age.mean())
df.at['Bob', 'job'] = None
#df.notna()
#df[df.age.notna()]

In [337]:
# for i, row in df.iterrows():
#     print(row['summary'])

# for i, col in df.items():
#     print(i)

#df.age > 50
df[[False, True, False, False, False, False]]

#(df.age > 10) & (df.job.notna())
# (df.age > 10) | (df.job.notna())
(df.name.str.endswith('e')) & (df.age.notna())
df.age = df.age.fillna(30)

In [338]:
import datetime as d

df['birthday'] = df['age'].apply(lambda x: d.datetime.now() - d.timedelta(days=365*x))
df[df.birthday.dt.year > 1950]

#ages = [30,80]
#df[df.age.isin(ages)]

#df.query('age > 30')
df = df.drop('summary', axis = 1)
df.groupby('job').agg({
    'age':'mean'
})

      age
job
CTO  26.0

In [339]:
df.loc[4] = ['Jane', 35, 'CTO', None]

df.groupby('job').agg({
    'age': ['mean', 'min', 'max', 'sum']
})

df.sort_values('age', ascending=False)

C:\Users\vladyslav.biedariev\AppData\Local\Temp\ipykernel_6776\1621284144.py:1: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df.loc[4] = ['Jane', 35, 'CTO', None]

        name   age   job                   birthday
3       John  45.0   CTO 1980-04-18 13:15:56.065951
1      Alice  37.0   CTO 1988-04-16 13:15:56.065936
4       Jane  35.0   CTO                        NaT
Alice    NaN  30.0   NaN 1995-04-15 13:15:56.065957
Bob      NaN  30.0  None 1995-04-15 13:15:56.065963
2        Bob  12.0   CTO 2013-04-10 13:15:56.065944
0       Mike  10.0   CTO 2015-04-10 13:15:56.065914

In [340]:
df1 = pd. DataFrame({
'Item' : ['A' , 'B' , 'C' ],
'Price': [10, 20, 30]

})

df2 = pd.DataFrame({
'Country' : ['D', 'E' , 'F'],
'Available': [True, False, True],
'Price': [10, 20, 30]
})

In [341]:
#pd.concat([df1, df2]).reset_index().drop('index' , axis=1)
#pd.concat([df1, df2], axis=1)
pd.merge(df1, df2, on='Price', how='right')

  Item  Price Country  Available
0    A     10       D       True
1    B     20       E      False
2    C     30       F       True